Revit 2027 API
MEPNetworkSegmentData.ReynoldsNumber Property
 The Reynolds number of this segment, dimensionless.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ReynoldsNumber { get; }
Public ReadOnly Property ReynoldsNumber As Double
	Get
public:
property double ReynoldsNumber {
	double get ();
}
member ReynoldsNumber : float with get
Property Value
Double
See Also
Reference
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace